{
  "profile": {
    "name": "Geilton Xavier",
    "title": "Senior Software Engineer",
    "location": "Lisbon, Portugal",
    "origin": "São Paulo, Brazil",
    "avatar": "https://avatars2.githubusercontent.com/u/4085573"
  },
  "about": {
    "headline": "Passionate Developer & Nature Enthusiast",
    "description": [
      "With over a decade of experience in software development, I specialize in .NET technologies, cloud-native solutions, and technical leadership. Currently working at Siemens Portugal, I focus on building scalable, secure applications using Azure services and DevOps practices.",
      "My journey spans from junior developer to senior software architect, working with companies across Brazil and Portugal. I'm passionate about clean architecture, domain-driven design, and helping teams deliver high-quality software solutions.",
      "When I'm not coding, you'll find me exploring nature, hiking mountains, and capturing moments through photography. I believe the best solutions come from a clear mind and fresh perspective."
    ]
  },
  "skills": [
    {
      "title": "🔧 Technologies",
      "items": ".NET Core/8, C#, Azure, Docker, Kubernetes"
    },
    {
      "title": "☁️ Cloud Expertise",
      "items": "Azure Functions, DevOps, Infrastructure as Code"
    },
    {
      "title": "🏗️ Architecture",
      "items": "Clean Architecture, DDD, TDD, Microservices"
    }
  ],
  "now": [
    {
      "icon": "🏢",
      "title": "Senior Software Engineer at Siemens Portugal",
      "description": "Leading cloud-native development in Smart Infrastructure, focusing on Azure services, DevOps practices, and technical leadership since December 2024."
    },
    {
      "icon": "📚",
      "title": "Continuous Learning",
      "description": "Recently completed my Bachelor's in Computer Science at ETEP University. Always exploring new technologies and best practices in software architecture."
    },
    {
      "icon": "🌱",
      "title": "Open Source Contribution",
      "description": "Maintaining 'Aprenda GO' - an open source knowledge center for the Go programming language, helping developers learn and grow."
    },
    {
      "icon": "🏔️",
      "title": "Exploring Portugal",
      "description": "Discovering the beautiful landscapes of Portugal, from mountain trails to coastal paths, always with my camera ready for the perfect shot."
    }
  ],
  "blog": {
    "headline": "Technical Insights & Experiences",
    "description": [
      "I share my thoughts on software architecture, cloud development, and lessons learned from years in the industry. From technical deep-dives to career reflections, you'll find authentic insights from a developer's journey.",
      "Topics include .NET best practices, Azure cloud solutions, clean architecture principles, and the intersection of technology with nature and mindfulness."
    ],
    "link": "https://geiltonxavier.substack.com/",
    "note": "Blog link will redirect to your external blog platform"
  }
}
